Documents/ЗарплатаМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ЗарплатаМенеджеров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗаработнойПлаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗарплатаМенеджеров/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗарплатаМенеджеров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗарплатаМенеджеров.Дата,
	|	ЗарплатаМенеджеров.КонецПериода,
	|	ЗарплатаМенеджеров.Менеджер,
	|	ЗарплатаМенеджеров.Зарплата.(
	|		Ставка,
	|		СуммаПродаж,
	|		СуммаЗаработнойПлаты
	|	)
	|ИЗ
	|	Документ.ЗарплатаМенеджеров КАК ЗарплатаМенеджеров
	|ГДЕ
	|	ЗарплатаМенеджеров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗарплатаШапка = Макет.ПолучитьОбласть("ЗарплатаШапка");
	ОбластьЗарплата = Макет.ПолучитьОбласть("Зарплата");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЗарплатаШапка);
		ВыборкаЗарплата = Выборка.Зарплата.Выбрать();  
		СуммаИтог = 0;
		СуммаИтого = "";
		Пока ВыборкаЗарплата.Следующий() Цикл
			ОбластьЗарплата.Параметры.Заполнить(ВыборкаЗарплата);
			ТабДок.Вывести(ОбластьЗарплата, ВыборкаЗарплата.Уровень());  
			СуммаИтог = СуммаИтог + ВыборкаЗарплата.СуммаЗаработнойПлаты;
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		СуммаИтого = ЧислоПрописью(СуммаИтог, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек");  
		ОбластьИтог.Параметры.Итог = СуммаИтог;
		ОбластьИтог.Параметры.ИтогПроп = СуммаИтого; 
		ТабДок.Вывести(ОбластьИтог);
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
